// 数値
//2進数、8進数、16進数

// Number オブジェクト
// Number オブジェクトプロパティ、Number オブジェクトメソッド
// Number.prototype メソッド

// Math オブジェクト
// 数学定数及び数学関数のためのプロパティとメソッドを有する。

// Date オブジェクト
// 日付の設定、取得、操作を行うたすうのメソッドを有する。


// テキスト処理

// 文字列

// String オブジェクト
// 文字列プリミティブデータ型のためのラッパ

// マルチインラインテンプレート文字列
// 式を埋め込むことができる文字列リテラル
const five = 5;
const ten = 10;
console.log(`Fifteen is ${five + ten} and not ${2 * five + ten}.`);
// "Fifteen is 15 and not 20."


// 国際化
// 各言語に応じた文字列比較、数値フォーマット、日時フォーマットを提供する。

// 日時フォーマット
// 数値フォーマット
// 照合


// 正規表現
