/* データ構造とデータ型 */

/* データ型 */
// 最新の ECMAScript 標準では、以下の8つのデータ型が定義されている。
// プリミティブ型
    // Boolean: true または false
    // null: null 値を表す。null は Null や NULL などとは異なる(大文字小文字を区別するため)。
    // undefuned(未定義): 値が未定義の最上位プロパティ。
    // Number(数値): 整数または浮動小数点。4や3.14159など。
    // BigInt(長整数): 精度が自由な整数値。例えば 9007199254740992n など。
    // String(文字列): テキストの値を表す連続下文字列。"Howdy" など。
    // Symbol(シンボル): (ECMAScript 2015 の新機能)。インスタンスが固有で不変となるデータ型。
// Object (オブジェクト)。
// オブジェクトとはデータとそのデータをやり取りするための命令が入ったデータ構造。
// オブジェクトはしばしば現実世界の物事を参照することがある。
// 例: レージングゲームでは car や map という具合に。